# notification-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:notification]
module.common_resources.module.kafka_retry_topic[0].data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_retry_topic[0].upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-a1bc3021-2668-41b3-a442-b4974dfbdf6a]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_deadletter_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-e95f40b9-1092-4b2b-b728-730056ea1ee9]
module.common_resources.module.kafka_deadletter_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-ea8bdb3e-285b-44bb-ae43-7bc12800955a]
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=89aed7d6-74bd-48f1-b647-6af2544ab965:notification_database_migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "notification"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "notification_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "89aed7d6-74bd-48f1-b647-6af2544ab965:notification_database_migration"
        name       = "notification_database_migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "f8fe2348-835b-42cb-bff9-06e5febd9d41" -> "50318c59-b658-4661-b3eb-4f38cbaa7aec"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*